nelsonlobo/stm32f446re_explore/05_GPIO_drivers/Src/02_led_button.c
/*
 * 02_led_button.c
 *
 *  Created on: Jun 22, 2025
 *      Author: lenovo
 */


#include "stm32f446xx.h"
#include "stm32f446xx_gpio_driver.h"

void delay(void)
{
	for(uint32_t i = 0; i< 500000;i++);
}

int main (void)
{
	GPIO_Handle_t GpioLed,GpioBtn;

	//Configure the LED GPIO pin
	GpioLed.pGPIOx = GPIOA;
	GpioLed.GPIO_PinConfig.GPIO_PinNumber = GPIO_PIN_NUM5;
	GpioLed.GPIO_PinConfig.GPIO_PinMode = GPIO_MODE_OUTPUT;
	GpioLed.GPIO_PinConfig.GPIO_PinSpeed = GPIO_SPEED_FAST;
	GpioLed.GPIO_PinConfig.GPIO_PinOPType = GPIO_OP_TYPE_PP;
	GpioLed.GPIO_PinConfig.GPIO_PinPuPdControl = GPIO_NO_PUPD;

	GPIO_PClk_Ctrl(GPIOA, ENABLE);
	GPIO_Init(&GpioLed);

	//Configure the User button GPIO pin
	GpioBtn.pGPIOx = GPIOC;
	GpioBtn.GPIO_PinConfig.GPIO_PinNumber = GPIO_PIN_NUM13;
	GpioBtn.GPIO_PinConfig.GPIO_PinMode = GPIO_MODE_INPUT;
	GpioBtn.GPIO_PinConfig.GPIO_PinSpeed = GPIO_SPEED_FAST;
//	GpioBtn.GPIO_PinConfig.GPIO_PinOPType = GPIO_OP_TYPE_OD;	//Not applicable in input mode
	GpioBtn.GPIO_PinConfig.GPIO_PinPuPdControl = GPIO_PIN_PU;

	GPIO_PClk_Ctrl(GPIOC, ENABLE);
	GPIO_Init(&GpioBtn);

	while(1)
	{
		if(!GPIO_ReadFromInputPin(GPIOC,GPIO_PIN_NUM13))
		{
			GPIO_TogglePin(GPIOA,GPIO_PIN_NUM5);
			delay();
		}
	}
	return 0;
}
